Ran Plan for 2 projects:

1. dir: `Project_2` workspace: `default`
1. dir: `.` workspace: `default`

### 1. dir: `Project_2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc_creation[0].google_compute_firewall.name has been deleted
- resource "google_compute_firewall" "name" {
      - creation_timestamp = "2025-06-26T03:15:27.148-07:00" -> null
      - destination_ranges = [] -> null
      - direction          = "INGRESS" -> null
      - disabled           = false -> null
      - id                 = "projects/terraform-gcp-2-464005/global/firewalls/gcloud-firewall-atlantis" -> null
      - name               = "gcloud-firewall-atlantis" -> null
      - network            = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-2-464005/global/networks/gcloud-network-using-atlantis-p2" -> null
      - priority           = 500 -> null
      - project            = "terraform-gcp-2-464005" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-2-464005/global/firewalls/gcloud-firewall-atlantis" -> null
      - source_ranges      = [
          - "14.97.94.230/32",
        ] -> null

      - allow {
          - ports    = [
              - "161",
            ] -> null
          - protocol = "udp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "icmp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "tcp" -> null
        }
    }
  # module.vpc_creation[0].google_compute_network.network1 has been deleted
- resource "google_compute_network" "network1" {
      - auto_create_subnetworks                   = false -> null
      - bgp_always_compare_med                    = false -> null
      - bgp_best_path_selection_mode              = "LEGACY" -> null
      - delete_default_routes_on_create           = false -> null
      - enable_ula_internal_ipv6                  = false -> null
      - id                                        = "projects/terraform-gcp-2-464005/global/networks/gcloud-network-using-atlantis-p2" -> null
      - mtu                                       = 0 -> null
      - name                                      = "gcloud-network-using-atlantis-p2" -> null
      - network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL" -> null
      - network_id                                = "2668630138042753863" -> null
      - numeric_id                                = "2668630138042753863" -> null
      - project                                   = "terraform-gcp-2-464005" -> null
      - routing_mode                              = "REGIONAL" -> null
      - self_link                                 = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-2-464005/global/networks/gcloud-network-using-atlantis-p2" -> null
    }
  # module.vpc_creation[0].google_compute_subnetwork.name has been deleted
- resource "google_compute_subnetwork" "name" {
      - creation_timestamp         = "2025-06-26T03:15:27.993-07:00" -> null
      - enable_flow_logs           = false -> null
      - gateway_address            = "10.1.0.1" -> null
      - id                         = "projects/terraform-gcp-2-464005/regions/asia-southeast1/subnetworks/atlantis-subnetwork" -> null
      - ip_cidr_range              = "10.1.0.0/24" -> null
      - name                       = "atlantis-subnetwork" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-2-464005/global/networks/gcloud-network-using-atlantis-p2" -> null
      - private_ip_google_access   = true -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "terraform-gcp-2-464005" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "asia-southeast1" -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-2-464005/regions/asia-southeast1/subnetworks/atlantis-subnetwork" -> null
      - stack_type                 = "IPV4_ONLY" -> null
      - subnetwork_id              = 6387648925308855120 -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.bucket_creation[0].google_storage_bucket.bucket1["gcloud-bucket-using-t3-p2"] will be created
+ resource "google_storage_bucket" "bucket1" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "gcloud-bucket-using-t3-p2"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "REGIONAL"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 15
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = "ANY"
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.bucket_creation[0].google_storage_bucket.bucket1["gcloud-bucket-using-tl1-p2"] will be created
+ resource "google_storage_bucket" "bucket1" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "gcloud-bucket-using-tl1-p2"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "REGIONAL"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 15
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = "ANY"
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.bucket_creation[0].google_storage_bucket.bucket1["gcloud-bucket-using-tl2-p2"] will be created
+ resource "google_storage_bucket" "bucket1" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "gcloud-bucket-using-tl2-p2"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "REGIONAL"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 15
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = "ANY"
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.bucket_creation[0].google_storage_bucket_object.object1["gcloud-bucket-using-t3-p2"] will be created
+ resource "google_storage_bucket_object" "object1" {
      + bucket         = "gcloud-bucket-using-t3-p2"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "sample_image"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "image1.png"
      + storage_class  = (known after apply)
    }

  # module.bucket_creation[0].google_storage_bucket_object.object1["gcloud-bucket-using-tl1-p2"] will be created
+ resource "google_storage_bucket_object" "object1" {
      + bucket         = "gcloud-bucket-using-tl1-p2"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "sample_image"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "image1.png"
      + storage_class  = (known after apply)
    }

  # module.bucket_creation[0].google_storage_bucket_object.object1["gcloud-bucket-using-tl2-p2"] will be created
+ resource "google_storage_bucket_object" "object1" {
      + bucket         = "gcloud-bucket-using-tl2-p2"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "sample_image"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "image1.png"
      + storage_class  = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_2`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
